# language: zh-CN

功能: 快手小游戏-oppoa59s手机
      @login
      场景: 登录测试
      假如 登录测试_获取登录按钮
      假如 登录测试_输入手机号:"10000119201"
      假如 登录测试_进入验证码界面
      假如 登录测试_输入验证码:"9201"
      假如 登录测试_拉取抽屉
      假如 登录测试_点击设置
      假如 登录测试_账号绑定
      假如 登录测试_返回
      假如 登录测试_返回
    
      @proflie
      场景: 个人资料
      假如 个人资料_点击个人资料
      假如 个人资料_编辑个人资料
      假如 个人资料_点击头像
      假如 个人资料_点击从相册选择
      假如 个人资料_点击第一张图片
      假如 个人资料_点击确定
      假如 个人资料_点击完成  
      假如 个人资料_返回
      假如 个人资料_好友
      假如 个人资料_切换到广场
      假如 登录测试_拉取抽屉
      假如 登录测试_点击设置
      假如 登录测试_点击退出登录
      假如 登录测试_点击退出登录_1

      @square
      场景: 广场
      假如 广场_点赞
      假如 广场_更多
      假如 广场_关注
      假如 广场_更多
      假如 广场_举报
      假如 广场_选择举报理由
      假如 广场_提交举报
      假如 广场_发布按钮
      假如 广场_输入文字:"1314520"
      假如 广场_点击发布
      假如 广场_更多
      假如 广场_删除
      假如 广场_确认删除
      假如 登录测试_拉取抽屉
      假如 登录测试_点击设置
      假如 登录测试_点击退出登录
      假如 登录测试_点击退出登录_1




      



